snlkuharlocal/src/Documents/ЛистМаркировки/ЛистМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистМаркировки</name>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОклейкаНеВыполнялась</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНаборы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковокРаспечатанная</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПечати</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтатусыКодовМаркировкиФакт/СтатусыКодовМаркировкиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКодовМаркировкиФакт</name>
  <enumValues>
    <name>Эмитирован</name>
  </enumValues>
  <enumValues>
    <name>ПереданПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ГотовКПечати</name>
  </enumValues>
  <enumValues>
    <name>Распечатан</name>
  </enumValues>
  <enumValues>
    <name>Нанесен</name>
  </enumValues>
  <enumValues>
    <name>НанесенВиртуально</name>
  </enumValues>
  <enumValues>
    <name>Вложен</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ВОбороте</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Списан</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ЗакупленВРФ</name>
  </enumValues>
  <enumValues>
    <name>Выбыл</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Расформирован</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяАгрегация</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ЛистМаркировки/Forms/ФормаДокумента/Module.bsl
&НаСервере
Перем ММвВПикселе; 
Перем CodeGenerator;	



#Область ФормированиеЭтикетки
&НаСервере
Функция СформироватьQRКодЭтикетки(Знач Выборка,ТД_Результат = неопределено)
	
	
	// Андреев И.Д. 22.04.2025 начало
	Если ТД_Результат = неопределено тогда
		ТД_Результат = Новый ТабличныйДокумент;
	КонецЕсли;
	// Андреев И.Д. 22.04.2025 конец
	
	ТД_Результат.ПолеСверху	= 0.0;
	ТД_Результат.ПолеСнизу 	= 0.0;
	ТД_Результат.ПолеСправа = 0.0;
	ТД_Результат.ПолеСлева 	= 0.0;		
	ТД_Результат.ШиринаСтраницы=25;
	ТД_Результат.ВысотаСтраницы=50;
	ТД_Результат.ИмяПараметровПечати="АвтоПечатьКодаЧЗПриСканированияЛН";
	

	ОбработкаПечати=Обработки.ПечатьЭтикетокЧЗ.Создать();
	Макет=ОбработкаПечати.ПолучитьМакет("Этикетка_25_25");
	ОбластьПечати 			= Макет.ПолучитьОбласть("Товар|Колонка");
	СтрокаКМ			= Справочники.ШтрихкодыУпаковокТоваров.ВосстановитьКод_GS1(Выборка.ЗначениеКМ); 
	ПоляШК 				= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьПоляШК_GS1(СтрокаКМ);
	ВывестиШК(ОбластьПечати, "ШК_ДатаМатрикс", СформироватьКартинкуШК_DataMatrix(СтрокаКМ));
	
	ОбластьПечати.Параметры.Заполнить(Выборка);	
	ОбластьПечати.Параметры.Заполнить(ПоляШК);	
	
	ТД_Результат.Вывести(ОбластьПечати);
	//  30.04.2025 начало
	ТД_Результат.ВывестиГоризонтальныйРазделительСтраниц();
	 
	//  30.04.2025 конец
	
	возврат ТД_Результат;
	
КонецФункции

&НаСервере
Процедура ВывестиШК(Область, ИмяРисунка, Картинка)	
	Рис 				= Область.Рисунки[ИмяРисунка];
	
	Рис.РазмерКартинки	= РазмерКартинки.Пропорционально;
	Рис.Линия			= Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	
	Рис.Картинка 		= Картинка;
КонецПроцедуры 

&НаСервере
Функция СформироватьКартинкуШК_DataMatrix(Знач ШтрихКод)    
	
	ПараметрыШтрихкода = ПараметрыГенерацииШКпоУмолчанию();
	ПараметрыШтрихкода.ТипВходныхДанных = 1; // Тип входных данных (0-Строка, 1-Base64).
	
	ПараметрыШтрихкода.ТипКода	= 24; //24(тип кода - GS1 databar extended stacked), [с версии 9.0.2.2],
	ПараметрыШтрихкода.Штрихкод	= Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(ШтрихКод));
	
	РезультатШтрихкод = ПодготовитьИзображениеШтрихкода(КомпонентаФормированияDataMatrixКода(), ПараметрыШтрихкода);
	
	Если НЕ РезультатШтрихкод.Успешно Тогда
		Сообщить(СтрШаблон("Ошибка генерации изображения штрихкода: '%1'", ШтрихКод));	
	КонецЕсли;
	
	Возврат РезультатШтрихкод.Картинка;
	
КонецФункции

&НаСервере
Функция ПараметрыГенерацииШКпоУмолчанию() Экспорт
	
	ПараметрыШтрихкода = Новый Структура;
	
	ПараметрыШтрихкода.Вставить("Ширина", 						150);
	ПараметрыШтрихкода.Вставить("Высота", 						150);
	ПараметрыШтрихкода.Вставить("ТипКода", 						99);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",				Ложь);
	ПараметрыШтрихкода.Вставить("РазмерШрифта", 				12);
	ПараметрыШтрихкода.Вставить("УголПоворота", 				0);
	ПараметрыШтрихкода.Вставить("Штрихкод",				 		"");
	ПараметрыШтрихкода.Вставить("ПрозрачныйФон", 				Истина);
	ПараметрыШтрихкода.Вставить("УровеньКоррекцииQR",		 	1);
	ПараметрыШтрихкода.Вставить("Масштабировать", 				Ложь);
	ПараметрыШтрихкода.Вставить("СохранятьПропорции", 			Ложь);
	ПараметрыШтрихкода.Вставить("ВертикальноеВыравнивание" , 	1); 
	ПараметрыШтрихкода.Вставить("GS1DatabarКоличествоСтрок", 	2);
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 			0);
	ПараметрыШтрихкода.Вставить("УбратьЛишнийФон",	 			Ложь); 
	ПараметрыШтрихкода.Вставить("ЛоготипКартинка");
	ПараметрыШтрихкода.Вставить("ЛоготипРазмерПроцентОтШК");
	
	Возврат ПараметрыШтрихкода;
	
КонецФункции

&НаСервере
Функция КомпонентаФормированияDataMatrixКода() Экспорт
	Если CodeGenerator<>Неопределено Тогда
		Возврат CodeGenerator;	
	КонецЕсли; 
	
	ТекстОшибки = НСтр("ru = 'Не удалось подключить внешнюю компоненту для генерации DataMatrix-кода.'");
	
	CodeGenerator = ПодключитьКомпонентуИзМакета("Barcode", "ОбщийМакет.КомпонентаПечатиШтрихкодов");
	Если CodeGenerator = Неопределено Тогда 
		Сообщить(ТекстОшибки);
	КонецЕсли;
	
	Возврат CodeGenerator;	
КонецФункции

Функция ПодготовитьИзображениеШтрихкода(ВнешняяКомпонента, ПараметрыШтрихкода)
	
	// Результат 
	РезультатОперации = Новый Структура("Успешно,ДвоичныеДанные,Картинка", Ложь);	
	
	// Зададим размер формируемой картинки.
	ШиринаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Ширина),1);
	ВысотаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Высота),1);	
	
	ВнешняяКомпонента.Ширина = ШиринаШтрихкода;
	ВнешняяКомпонента.Высота = ВысотаШтрихкода;
	ВнешняяКомпонента.АвтоТип = Ложь;
	
	ШтрихкодВрем = Строка(ПараметрыШтрихкода.Штрихкод); // Преобразуем явно в строку.
	
	Если ПараметрыШтрихкода.ТипКода = 99 Тогда
		ВнешняяКомпонента.АвтоТип = Истина;
	Иначе
		ВнешняяКомпонента.АвтоТип = Ложь;
		ВнешняяКомпонента.ТипКода = ПараметрыШтрихкода.ТипКода;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ПрозрачныйФон") Тогда
		ВнешняяКомпонента.ПрозрачныйФон = ПараметрыШтрихкода.ПрозрачныйФон;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ТипВходныхДанных") Тогда
		ВнешняяКомпонента.ТипВходныхДанных = ПараметрыШтрихкода.ТипВходныхДанных;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("GS1DatabarКоличествоСтрок") Тогда
		ВнешняяКомпонента.GS1DatabarКоличествоСтрок = ПараметрыШтрихкода.GS1DatabarКоличествоСтрок;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("УбратьЛишнийФон") Тогда
		ВнешняяКомпонента.УбратьЛишнийФон = ПараметрыШтрихкода.УбратьЛишнийФон;
	КонецЕсли;
	
	ВнешняяКомпонента.ОтображатьТекст = ПараметрыШтрихкода.ОтображатьТекст;
	// Формируем картинку штрихкода.
	ВнешняяКомпонента.ЗначениеКода = ШтрихкодВрем;
	// Угол поворота штрихкода.
	ВнешняяКомпонента.УголПоворота = ?(ПараметрыШтрихкода.Свойство("УголПоворота"), ПараметрыШтрихкода.УголПоворота, 0);
	// Уровень коррекции QR кода (L=0, M=1, Q=2, H=3).
	ВнешняяКомпонента.УровеньКоррекцииQR = ?(ПараметрыШтрихкода.Свойство("УровеньКоррекцииQR"), ПараметрыШтрихкода.УровеньКоррекцииQR, 1);
	
	// Для обеспечения совместимости с предыдущими версиями БПО.
	Если Не ПараметрыШтрихкода.Свойство("Масштабировать")
		Или (ПараметрыШтрихкода.Свойство("Масштабировать") И ПараметрыШтрихкода.Масштабировать) Тогда
		
		Если Не ПараметрыШтрихкода.Свойство("СохранятьПропорции")
			Или (ПараметрыШтрихкода.Свойство("СохранятьПропорции") И Не ПараметрыШтрихкода.СохранятьПропорции) Тогда
			// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
				ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
			КонецЕсли;
			// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
				ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
			КонецЕсли;
		ИначеЕсли ПараметрыШтрихкода.Свойство("СохранятьПропорции") И ПараметрыШтрихкода.СохранятьПропорции Тогда
			Пока ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода 
				Или ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Цикл
				// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
					ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
					ВнешняяКомпонента.Высота = Окр(ВнешняяКомпонента.МинимальнаяШиринаКода / ШиринаШтрихкода) * ВысотаШтрихкода;
				КонецЕсли;
				// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
					ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
					ВнешняяКомпонента.Ширина = Окр(ВнешняяКомпонента.МинимальнаяВысотаКода / ВысотаШтрихкода) * ШиринаШтрихкода;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// ВертикальноеВыравниваниеКода: 1 - по верхнему краю, 2 - по центру, 3 - по нижнему краю.
	Если ПараметрыШтрихкода.Свойство("ВертикальноеВыравнивание") И (ПараметрыШтрихкода.ВертикальноеВыравнивание > 0) Тогда
		ВнешняяКомпонента.ВертикальноеВыравниваниеКода = ПараметрыШтрихкода.ВертикальноеВыравнивание;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И (ПараметрыШтрихкода.РазмерШрифта > 0) 
		И (ПараметрыШтрихкода.ОтображатьТекст) И (ВнешняяКомпонента.РазмерШрифта <> ПараметрыШтрихкода.РазмерШрифта) Тогда
		ВнешняяКомпонента.РазмерШрифта = ПараметрыШтрихкода.РазмерШрифта;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И ПараметрыШтрихкода.РазмерШрифта > 0
		И ПараметрыШтрихкода.Свойство("МонохромныйШрифт") Тогда
		Если ПараметрыШтрихкода.МонохромныйШрифт Тогда
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = ПараметрыШтрихкода.РазмерШрифта + 1;
		Иначе
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = -1;
		КонецЕсли;
	КонецЕсли;
	
	
	Если ПараметрыШтрихкода.ТипКода = 16 Тогда // QR
		Если ПараметрыШтрихкода.Свойство("ЛоготипКартинка") И ЗначениеЗаполнено(ПараметрыШтрихкода.ЛоготипКартинка) Тогда 
			ВнешняяКомпонента.ЛоготипКартинка = ПараметрыШтрихкода.ЛоготипКартинка;    
		Иначе
			ВнешняяКомпонента.ЛоготипКартинка = "";
		КонецЕсли;
		Если ПараметрыШтрихкода.Свойство("ЛоготипРазмерПроцентОтШК") И Не ПустаяСтрока(ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК) Тогда 
			ВнешняяКомпонента.ЛоготипРазмерПроцентОтШК = ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК;
		КонецЕсли;
	КонецЕсли;
	
	
	// Сформируем картинку
	ДвоичныеДанныеКартинки 		= ВнешняяКомпонента.ПолучитьШтрихкод();
	РезультатОперации.Успешно 	= (ВнешняяКомпонента.Результат = 0);
	// Если картинка сформировалась.
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		РезультатОперации.ДвоичныеДанные	= ДвоичныеДанныеКартинки;
		РезультатОперации.Картинка 			= Новый Картинка(ДвоичныеДанныеКартинки); // Формируем из двоичных данных.
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции
#конецобласти




&НаСервере
Функция ВнешнееСобытиеНаСервере(Данные)
	
	// Кухарь А.Ю. 06.05.2025 начало
	если Объект.ДатаНачалаСканирования = ПустаяДата() тогда
		Объект.ДатаНачалаСканирования = ТекущаяДата(); 
		Объект.Исполнитель = ОбщегоНазначения_ПИ.ПолучитьРеквизитШапкиПИ(ПараметрыСеанса.Пользователь,"ФизЛицо","Справочник");
	КонецЕсли;   
	Объект.ДатаОкончанияСканирования = ТекущаяДата(); 
	
	// Кухарь А.Ю. 06.05.2025 конец
	
	если Объект.Ссылка=Документы.ЛистМаркировки.ПустаяСсылка() тогда
		Записать();
	КонецЕсли;
	// Кухарь А.Ю. 15.04.2024 начало
	//
	НаименованиеМарки=""; 
	// Кухарь А.Ю. 15.04.2024 конец
	
	
	
	СтруктураВозврата=новый Структура("Успех,Ошибки,ТабДок,СразуПечатать",Истина,"",Неопределено,Ложь);
	МассивОшибок=новый Массив;
	если ОжидаемыйВидШК="Обычный штрих-код" тогда		
		МассивШК=ТаблицаШтрихКодов.НайтиСтроки(новый Структура("ШтрихКод",Данные));
		если МассивШК.Количество()=0 тогда
			СтруктураВозврата.Успех=ложь;
			СтруктураВозврата.Ошибки="Отсканирован штрих-код, отсутствующий в заявке на маркировку - "+Данные;
			Возврат СтруктураВозврата;
		КонецЕсли;
		
		Номенклатура=МассивШК.Получить(0).Номенклатура;
		// Кухарь А.Ю. 27.09.2024 начало
		//
		если ПолучитьРеквизитШапки(Номенклатура,"ОтгрузкаТолькоЧерезЧЗ","Справочник") тогда
			СтруктураВозврата.Успех=ложь;
			СтруктураВозврата.Ошибки=СтрШаблон("По номенклатуре %1, весь товар уже промаркирован, необходимо найти на товаре код маркировки и отсканировать его в ЛН. Нанесение кода маркировки не требуется.",Номенклатура);
			Возврат СтруктураВозврата;			
		КонецЕсли;
		// Кухарь А.Ю. 27.09.2024 конец
		
		//Валетов + 03,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8746
		//КоличествоВЗаявке=МассивШК.Получить(0).Количество; 
		КоличествоВЗаявке = 0;
		Для каждого Элем Из МассивШК Цикл
			КоличествоВЗаявке = КоличествоВЗаявке + Элем.Количество;
		КонецЦикла;
		//Валетов -
		
		КоличествоОтсканировано=ПолучитьКоличествоОтсканированногоТовара(Номенклатура);
		если КоличествоВЗаявке<=КоличествоОтсканировано тогда
			СтруктураВозврата.Успех=ложь;
			СтруктураВозврата.Ошибки=СтрШаблон("По номенклатуре %1, в заявке на оклейку %2 штук. Требуемое количество уже отсканировано.",Номенклатура,КоличествоВЗаявке);
			Возврат СтруктураВозврата;
		КонецЕсли;
	иначе
		НаименованиеМарки=Лев(Данные,31);	
		
		// Кухарь А.Ю.  03.07.2024 начало
		Объект.Дата=ТекущаяДатаСеанса(); 
		// Кухарь А.Ю.  03.07.2024 конец
		
		
	КонецЕсли;
	СтруктураВозврата=ОбработатьСканированиеМарки (Номенклатура,НаименованиеМарки);
	возврат СтруктураВозврата;
	
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоОтсканированногоТовара(Номенклатура)
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ТЗ.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ПОМЕСТИТЬ ВремТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ВремТЗ.ШтрихкодУпаковки) КАК Количество
	|ПОМЕСТИТЬ ВсеЛН
	|ИЗ
	|	ВремТЗ КАК ВремТЗ
	|ГДЕ
	|	ВремТЗ.ШтрихкодУпаковки.Владелец = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ТЗ.ШтрихкодУпаковки)
	|ИЗ
	|	Документ.ЛистМаркировки.ШтрихкодыУпаковок КАК ТЗ
	|ГДЕ
	|	ТЗ.Ссылка <> &Ссылка
	|	И ТЗ.Ссылка.ДокОснование = &ДокОснование
	|	И ТЗ.Ссылка.Проведен	
	|	И ТЗ.ШтрихкодУпаковки.Владелец = &Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВсеЛН.Количество) КАК Количество
	|ИЗ
	|	ВсеЛН КАК ВсеЛН";
	запрос.УстановитьПараметр("ТЗ",Объект.ШтрихкодыУпаковок.Выгрузить());
	запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	запрос.УстановитьПараметр("Ссылка",объект.Ссылка);
	// Кухарь А.Ю.  23.05.2024 начало
	//
	запрос.УстановитьПараметр("ДокОснование",Объект.ДокОснование);
	
	// Кухарь А.Ю.  23.05.2024 конец
	
	Выборка=запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл
		возврат Выборка.Количество;
	КонецЦикла;
	возврат 0;
	
КонецФункции

&НаСервере
Функция ОбработатьСканированиеМарки (Номенклатура,НаименованиеМарки="")
	СтруктураВозврата=новый Структура("Успех,Ошибки,ТабДок,СразуПечатать",Истина,"",Неопределено,Ложь);
	
	если ОжидаемыйВидШК="Обычный штрих-код" тогда		
		// Кухарь А.Ю.  27.03.2025 начало 	
		//СтруктураПоиска=новый Структура("Номенклатура,ТипШК,Подразделение,МассивИсключаемыхКодов",Номенклатура,Перечисления.ТипыШтрихКодов.Штука,объект.Подразделение,Объект.ШтрихкодыУпаковок.Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки"));
		//СтруктураКода=МаркировкаКС.ПолучитьСвободныйКодДляПечати(СтруктураПоиска);
		НайденныйКод=Неопределено;
		МассивНоменклатуры=новый Массив;
		МассивНоменклатуры.Добавить(Номенклатура);
		ДопПараметры=новый Структура("Добавлять",Истина);
		РезультатПолученияКодов=Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(МассивНоменклатуры,Объект.Ссылка,ДопПараметры);	
		если РезультатПолученияКодов.Успешно тогда
			Для каждого СтрокаДанных из РезультатПолученияКодов.Данные.получить(Номенклатура) цикл
				НайденныйКод=СтрокаДанных;
			КонецЦикла;
		иначе
			РезультатПолученияКодов.Вставить("Успех",ложь);
			Возврат РезультатПолученияКодов;
		КонецЕсли;
		если НайденныйКод <>Неопределено тогда
			СтруктураКода=МаркировкаКС.ПолучитьСтруктуруКодаДляПечати(НайденныйКод);
		КонецЕсли;	
		// Кухарь А.Ю.  27.03.2025 конец
		
		
		если не СтруктураКода.Успех тогда
			СтруктураВозврата.Ошибки=СтруктураКода.Ошибки;
			СтруктураВозврата.Успех=ложь;
		иначе
			ДатаПечати=ТекущаяДата();
			//СтрокаТЧ=объект.ШтрихкодыУпаковокРаспечатанная.Добавить();
			//СтрокаТЧ.ШтрихкодУпаковки=СтруктураКода.кодЧЗ;
			//СтрокаТЧ.ДатаПечати=ДатаПечати;
			СтрокаТЧШтрихкодыУпаковок=объект.ШтрихкодыУпаковок.Добавить();
			СтрокаТЧШтрихкодыУпаковок.ШтрихкодУпаковки=СтруктураКода.кодЧЗ;
			попытка			
				Записать();
			Исключение
				//объект.ШтрихкодыУпаковокРаспечатанная.Удалить(объект.ШтрихкодыУпаковокРаспечатанная.Индекс(СтрокаТЧ));
				объект.ШтрихкодыУпаковок.Удалить(объект.ШтрихкодыУпаковок.Индекс(СтрокаТЧШтрихкодыУпаковок));
				СтруктураВозврата.Успех=ложь;
				СтруктураВозврата.Ошибки="Ошибка формирования кода для печати. Попробуйте ещё раз. "+ОписаниеОшибки();
				возврат СтруктураВозврата;
			КонецПопытки;
			
			запрос=новый запрос;
			запрос.Текст= "ВЫБРАТЬ первые 1
			|	СтатусыКМ_Факт.Регистратор КАК Регистратор
			|ИЗ
			|	РегистрСведений.СтатусыКМ_Факт КАК СтатусыКМ_Факт
			|ГДЕ
			|	СтатусыКМ_Факт.Период МЕЖДУ &Дата1 И &Дата2
			|	И СтатусыКМ_Факт.ШтрихКодУпаковки = &ШтрихКодУпаковки
			|	И СтатусыКМ_Факт.Регистратор <> &Регистратор
			|	И СтатусыКМ_Факт.Статус = &Статус";
			запрос.УстановитьПараметр("Дата1",ДатаПечати-60);
			запрос.УстановитьПараметр("Дата2",ДатаПечати+60);
			запрос.УстановитьПараметр("ШтрихКодУпаковки",СтруктураКода.кодЧЗ);
			запрос.УстановитьПараметр("Регистратор",Объект.Ссылка);	
			запрос.УстановитьПараметр("Статус",Перечисления.СтатусыКодовМаркировкиФакт.Распечатан);
			ВыборкаДублей=запрос.Выполнить().Выбрать();
			
			если ВыборкаДублей.Количество()>0 тогда
				СтруктураВозврата.Успех=ложь;
				СтруктураВозврата.Ошибки="Ошибка формирования кода для печати. Попробуйте ещё раз.";						
				//объект.ШтрихкодыУпаковокРаспечатанная.Удалить(объект.ШтрихкодыУпаковокРаспечатанная.Индекс(СтрокаТЧ));
				Записать();
				возврат СтруктураВозврата;				
			КонецЕсли;			
			ТекущаяМарка=СтруктураКода.кодЧЗ;
			ТабДок=СформироватьQRКодЭтикетки (СтруктураКода);
			если ТабДок<>Неопределено тогда
				СтруктураВозврата.ТабДок=ТабДок;
				СтруктураВозврата.СразуПечатать=ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр;
			КонецЕсли;	
		КонецЕсли;
		// Кухарь А.Ю.  19.01.2025 конец
		
	иначе
		если  ЗначениеЗаполнено(ТекущаяМарка) и НаименованиеМарки<>"" тогда
			ОтсканированнаяМарка=Справочники.ШтрихкодыУпаковокТоваров.НайтиПоНаименованию(НаименованиеМарки);
			если не ЗначениеЗаполнено(ОтсканированнаяМарка) тогда
				СтруктураВозврата.Ошибки="Не найден код ЧЗ, отсканируйте код, последнего отсканированного товара.";
				СтруктураВозврата.Успех=ложь;
			ИначеЕсли  ОтсканированнаяМарка<>ТекущаяМарка тогда
				СтруктураВозврата.Ошибки="Отсканирована не та марка, которая была распечатана после сканирования обычного ШК.";
				СтруктураВозврата.Успех=ложь;
			иначе			
				строкаТЧ=Объект.ШтрихкодыУпаковок.Добавить();
				строкаТЧ.ШтрихкодУпаковки=ОтсканированнаяМарка;	
				ТекущаяМарка=Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка();
			КонецЕсли;
			
		иначе
			СтруктураВозврата.Ошибки="Не определена текущая марка, отсканируйте обычный штрих-код товара";
			СтруктураВозврата.Успех=ложь;
			ОжидаемыйВидШК="Обычный штрих-код";
		КонецЕсли;
	КонецЕсли;
	
	возврат СтруктураВозврата;
	
КонецФункции



&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	// Кухарь А.Ю.  03.07.2024 начало
	//
	если ТолькоПросмотр тогда
		Возврат;
	КонецЕсли;
	
	// Кухарь А.Ю.  03.07.2024 конец
	
	Если НЕ ЭтоСобытиеСканера(Событие) Тогда Возврат КонецЕсли;
	
	Если НЕ ВводДоступен() и Источник<>"ИмитацияСканирования" Тогда Возврат КонецЕсли; //кухарь 16.12.13 Имитация
	

	// Кухарь А.Ю. 17.03.2025 начало
	// Пустая задача
	//Данные=СтрЗаменить(Данные,Символы.ПС,"");		
	//данные=Лев(Данные,31); 	
	ПолныеДанные=СтрЗаменить(Данные,Символы.ПС,"");		
	данные=Лев(ПолныеДанные,31); 	
	// Кухарь А.Ю. 17.03.2025 конец
	
	
	
	глТорговоеОборудование.СканерПосылкаДанных(1);
	глСобытиеСканераОтработано=Истина;
	
	
	РезультатСканирования=ВнешнееСобытиеНаСервере(Данные);
	если не РезультатСканирования.Успех тогда
		// Кухарь А.Ю.  04.04.2025 начало
		
		//Сообщить(РезультатСканирования.Ошибки);
		если ТипЗнч(РезультатСканирования.Ошибки)=Тип("Массив") тогда		
			Сообщить(СтрСоединить(РезультатСканирования.Ошибки,Символы.ПС));
		иначе
			Сообщить(РезультатСканирования.Ошибки);
		КонецЕсли;
		// Кухарь А.Ю.  04.04.2025 конец
		
		Возврат;
	иначе
		
		// Кухарь А.Ю. 17.03.2025 начало
		// ASU-2105
		//Теперь всегда обычный ШК
		//если ОжидаемыйВидШК="Обычный штрих-код"  тогда
		//	ОжидаемыйВидШК="!!!!Код ЧЗ!!!!";
		//иначе
		//	ОжидаемыйВидШК="Обычный штрих-код";
		//КонецЕсли;
		если ЗначениеЗаполнено(ТекущаяМарка) тогда
			СтрокаКМ = СокрЛП(Справочники.ШтрихкодыУпаковокТоваров.ВосстановитьКод_GS1(ТекущаяМарка.ЗначениеШтрихкода));
			ОповеститьОВыборе(СтрокаКМ); 
		КонецЕсли;
		// Кухарь А.Ю. 17.03.2025 конец
		
	КонецЕсли;	
	
	ТабДок = РезультатСканирования.ТабДок;	
	
	Если ТабДок<>Неопределено Тогда
		//+++Чирков 24.04.2025
		//если ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр И НЕ фПечататьЛентуСразуНаПинтер тогда		
		Если НЕ фПечататьЛентуСразуНаПинтер Тогда
		//---Чирков 24.04.2025
			ТабДок.Показать();
		Иначе
			Попытка 
				ТабДок.Напечатать()
			Исключение
				ТабДок.Показать();
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихКоды.Наименование КАК ШтрихКод,
	|	ЗаданиеНаМаркировкуТовары.Номенклатура КАК Номенклатура,
	|	ЗаданиеНаМаркировкуТовары.Количество КАК Количество
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.Товары КАК ЗаданиеНаМаркировкуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихКоды КАК ШтрихКоды
	|		ПО ЗаданиеНаМаркировкуТовары.Номенклатура = ШтрихКоды.Владелец
	|			И (ШтрихКоды.ТипШК = ЗНАЧЕНИЕ(перечисление.ТипыШтрихКодов.Штука))
	|			И (НЕ ШтрихКоды.ПометкаУдаления)
	|ГДЕ
	|	ЗаданиеНаМаркировкуТовары.Ссылка = &ДокОснование";
	запрос.УстановитьПараметр("ДокОснование",Объект.ДокОснование);
	ТаблицаШтрихКодов.Загрузить(запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Кухарь А.Ю. 17.03.2025 начало
	// ASU-2105
	//если ЗначениеЗаполнено(ТекущаяМарка) тогда
	//	Сообщить("Вы забыли отсканировать последний распечатанный QR код."+ТекущаяМарка+" Отсканируйте его перед закрытием этого документа. Повторно можно распечатать кнопкой Повторить печать последнего QR");
	//	отказ=Истина;
	//	Возврат;
	//КонецЕсли;	 
	// Кухарь А.Ю. 17.03.2025 конец
	
 

	//
	//если Объект.ШтрихкодыУпаковок.Количество()>0 тогда
	//	ЗаписатьНаСервере();
	//КонецЕсли;	
	//
	//ОчиститьЛог();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере ()
	
	//Валетов + 12,11,2024
	//Закомментировал строку,из-за ошибки: 
	// {Документ.ЛистМаркировки.Форма.ФормаДокумента.Форма(598)}: Ошибка при вызове метода контекста (РеквизитФормыВЗначение) 
	
	//ДокОбъект=РеквизитФормыВЗначение("Объект");
	Попытка
		ДокОбъект = РеквизитФормыВЗначение("Объект");
	Исключение
		ДокОбъект = Объект.Ссылка.ПолучитьОбъект();
	КонецПопытки;
	//ЗаписатьВЛог("Отладка","1 "+ДокОбъект,"Информация");
	
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаСервере
Процедура ОчиститьЛог ()
	// Кухарь А.Ю.  03.03.2025 начало
	//Уже не используется
	//если ЗначениеЗаполнено(Объект.Ссылка) тогда
	//	НаборЗаписей=РегистрыСведений.ЛогАвтоПечатиКодовЧЗПриСканировании.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.Документ.Установить(объект.Ссылка);			
	//	НаборЗаписей.Записать(Истина);	
	//КонецЕсли;
	 
	// Кухарь А.Ю.  03.03.2025 конец
	
КонецПроцедуры

&НаКлиенте
Процедура ИмитацияСканированияПриИзменении(Элемент)
	ВнешнееСобытие("ИмитацияСканирования","BarCodeValue",ИмитацияСканирования);
	ИмитацияСканирования="";
	
КонецПроцедуры


&НаСервере
Функция ПечатьВыделеннойСтрокиНаСервере(МассивШк)
	// Андреев И.Д. 22.04.2025 начало
	ТД_Результат = Новый ТабличныйДокумент;
	
	Для каждого СтрМасс из МассивШк цикл 
		
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	ШтрихкодыУпаковокТоваров.Ссылка КАК КодЧЗ,
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеКМ,
		|	ШтрихкодыУпаковокТоваров.Владелец.Цвет КАК Цвет,
		|	ШтрихкодыУпаковокТоваров.Владелец.Размер КАК Размер,
		|	ШтрихкодыУпаковокТоваров.Владелец.Родитель.КодПроизводителя КАК Артикул
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.Ссылка = &Ссылка";
		запрос.УстановитьПараметр("Ссылка",СтрМасс);
		
		
		Выборка=запрос.Выполнить().Выбрать();
		
		
		// Андреев 24.04.2025 начало	
		пока Выборка.Следующий() цикл
			ТабДок=СформироватьQRКодЭтикетки (Выборка,ТД_Результат);	
		КонецЦикла;  
		// Андреев 24.04.2025 конец
		
	Конеццикла;
	
	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ПечатьВыделеннойСтроки(Команда)  
		
	// Андреев И.Д. 22.04.2025 начало	
	ТекДанные = элементы.штрихкодыупаковок.выделенныеСтроки;
	МассивШк = новый Массив;     
	
	СписокЗначений = новый СписокЗначений;
	
	Для каждого СтрМасс из ТекДанные цикл
		СписокЗначений.Добавить(СтрМасс);
	Конеццикла; 
	
	СписокЗначений.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	Для каждого СтрМасс из СписокЗначений цикл
		МассивШк.Добавить(элементы.штрихкодыупаковок.ДанныеСтроки(СтрМасс.Значение).штрихкодупаковки);	
	Конеццикла; 
		
	ТабДок = ПечатьВыделеннойСтрокиНаСервере(МассивШк);   
	// Андреев И.Д. 22.04.2025 конец
	
	если ТабДок<>Неопределено тогда
		
		// Смирнов М.Ю. 23.07.2025 HELP-4556 начало
		Если Команда.Имя = "ПечатьВыделенныхСтрок" Тогда
			ТабДок.показать();
			Возврат;
		КонецЕсли;
		
		Если Команда.Имя = "ПечатьВыделенныхСтрокНаПринтер" Тогда 
			ТабДок.Напечатать();
			Возврат;
		КонецЕсли;
		// Смирнов М.Ю. 23.07.2025 HELP-4556 конец
		
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюСервер();
	
	ОжидаемыйВидШК="Обычный штрих-код";
	если не ЗначениеЗаполнено(объект.Подразделение) тогда
		объект.Подразделение=ПараметрыСеанса.ЭтотУзел.Подразделение;
	КонецЕсли;
	
	//+++Чирков 24.04.2025
	фПечататьЛентуСразуНаПинтер = Истина;
	//---Чирков 24.04.2025	
КонецПроцедуры

// Кухарь А.Ю.  03.07.2024 начало
//
&НаСервере
Процедура УправлениеВидимостьюСервер ()
	// Кухарь А.Ю.  03.07.2024 начало
	//
	СостояниеНакладной=  ПолучитьРеквизитШапки(Объект.ЛистНабора,"ДокОснование.СостояниеНакладной","Документ");
	если СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке 
		или  СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена 
		тогда
		ЭтотОбъект.ТолькоПросмотр=Истина;
	КонецЕсли;
	
	
КонецПроцедуры
// Кухарь А.Ю.  03.07.2024 конец



&НаСервере
Функция ПовторитьПечатьПоследнегоQRНаСервере()
	// Вставить содержимое обработчика.
	если ЗначениеЗаполнено(ТекущаяМарка) тогда
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	ШтрихкодыУпаковокТоваров.Ссылка КАК КодЧЗ,
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеКМ,
		|	ШтрихкодыУпаковокТоваров.Владелец.Цвет КАК Цвет,
		|	ШтрихкодыУпаковокТоваров.Владелец.Размер КАК Размер,
		|	ШтрихкодыУпаковокТоваров.Владелец.Родитель.КодПроизводителя КАК Артикул
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.Ссылка = &Ссылка";
		запрос.УстановитьПараметр("Ссылка",ТекущаяМарка);
		
		
		Выборка=запрос.Выполнить().Выбрать();
		пока Выборка.Следующий() цикл
			ТабДок=СформироватьQRКодЭтикетки (Выборка);
			возврат ТабДок;
		КонецЦикла;
		
		
	иначе
		Сообщить("Воспользуйтесь печатью выделенной строки.");
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПовторитьПечатьПоследнегоQR(Команда)
	ТабДок=ПовторитьПечатьПоследнегоQRНаСервере();
	если ТабДок<>Неопределено тогда
		
		// Смирнов М.Ю. 23.07.2025 HELP-4556 начало
		Если Команда.Имя = "ПовторитьПечатьПоследнегоQR" Тогда
			ТабДок.показать();
			Возврат;
		КонецЕсли;
		
		Если Команда.Имя = "ПовторитьПечатьПоследнегоQRНаПринтер" Тогда
			ТабДок.Напечатать();
			Возврат;
		КонецЕсли;
		// Смирнов М.Ю. 23.07.2025 HELP-4556 конец
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПовторитьПечатьВыделеннойСтрокиПечатиНаСервере(ТекШтихКод,Ошибки)
	// Вставить содержимое обработчика.
	если объект.ШтрихкодыУпаковок.НайтиСтроки(новый Структура("ШтрихкодУпаковки",ТекШтихКод)).количество() > 0 тогда
		Ошибки="Этот код ЧЗ уже отсканирован, возобновление работы  нужно.";
		возврат Неопределено;
	КонецЕсли;
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК КодЧЗ,
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеКМ,
	|	ШтрихкодыУпаковокТоваров.Владелец.Цвет КАК Цвет,
	|	ШтрихкодыУпаковокТоваров.Владелец.Размер КАК Размер,
	|	ШтрихкодыУпаковокТоваров.Владелец.Родитель.КодПроизводителя КАК Артикул
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.Ссылка = &Ссылка";
	запрос.УстановитьПараметр("Ссылка",ТекШтихКод);
	
	
	Выборка=запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл
		ТабДок=СформироватьQRКодЭтикетки (Выборка);
		ТекущаяМарка=Выборка.кодЧЗ;
		ОжидаемыйВидШК="!!!!Код ЧЗ!!!!";	
		Возврат ТабДок;
	КонецЦикла;
	
	
	
КонецФункции

&НаКлиенте
Процедура ПовторитьПечатьВыделеннойСтрокиПечати(Команда)
	Ошибки="";
	ТекДанные=элементы.ШтрихкодыУпаковокРаспечатанная.ТекущиеДанные;
	ТабДок=ПовторитьПечатьВыделеннойСтрокиПечатиНаСервере(ТекДанные.ШтрихКодУпаковки,Ошибки);
	если ТабДок<>Неопределено тогда
		ТабДок.показать();
	КонецЕсли;
	если Ошибки<>"" тогда 
		Сообщить(Ошибки);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПоНапечатанномуНаСервере()
	для каждого СТрТЧ из объект.ШтрихкодыУпаковокРаспечатанная цикл
		МассивСтрок= объект.ШтрихкодыУпаковок.НайтиСтроки(новый Структура("ШтрихкодУпаковки",СТрТЧ.ШтрихкодУпаковки));
		если МассивСтрок.Количество() = 0  тогда
			СтрокаКода= объект.ШтрихкодыУпаковок.Добавить();
			СтрокаКода.ШтрихкодУпаковки=СТрТЧ.ШтрихкодУпаковки;
		КонецЕсли;
	КонецЦикла;// Вставить содержимое обработчика.
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоНапечатанному(Команда)

	ЗаполнитьПоНапечатанномуНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Очистить(Команда)
ОчиститьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
	если не РольДоступна("Администратор") тогда возврат;КонецЕсли;
	Объект.ШтрихкодыУпаковок.Очистить();
	объект.ШтрихкодыУпаковокРаспечатанная.Очистить();;
КонецПроцедуры
